#####################################################################################
# File  	    :   .brewfile
# Description	:   Contains a list of brew instructions to install 
#                   (cask) applications, mas (Mac App Store), fonts et al.
# Args         	:   none
# Dependencies  :   brew, cask
# Author       	:   topscoder
# Email         :   topscoder.at.gmail.dot.com
#####################################################################################
# See: github.com/Homebrew/homebrew-bundle

# mas-cli – cli interface for Mac App Store
# See: https://github.com/mas-cli/mas
brew "mas"

# GNU core utilities (those that come with OS X are outdated)
brew "coreutils"
brew "moreutils"

# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"

# GNU `sed`
brew "gnu-sed"

# Install more recent versions of some OS X tools
brew "grep"
brew "nano"
brew "openssh"
brew "vim"
brew "wget"

# better `top`
brew "glances"

# See: https://sourabhbajaj.com/mac-setup/BashCompletion/
brew "bash-completion"

# Install homebrew packages (default -cli- applications)
brew "git"
brew "pre-commit" # ❤️

# See: https://github.com/git-friendly/git-friendly
tap "git-friendly/homebrew-git-friendly"
brew "git-friendly/git-friendly/git-friendly"

# Just some useful apps
brew "antibody"
brew "docker-compose"
brew "docker"
brew "dockutil"
brew "mackup"
brew "pipenv"
brew "zsh-async"
brew "zsh"

# Install native GUI applications using brew --cask
cask "appcleaner"
cask "keepassxc"
cask "commander-one"
cask "element"
cask "keepingyouawake"
cask "kitty"
cask "opera"
cask "pycharm-ce"
cask "rectangle"
cask "rocket"
cask "ubersicht"
cask "vmware-fusion"
cask "vscodium"

# Free Database Management Tool
# cask valentina-studio

# Quick Look Plugins
cask "betterzip"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"
cask "qlimagesize"
cask "quicknfo"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-fantasque-sans-mono-nerd-font"
